Revit 2027 API
PlanCircuit Class
An object that represents an enclosed area in a plan view within the Autodesk Revit project.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PlanCircuit
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PlanCircuit : APIObject
Public Class PlanCircuit
	Inherits APIObject
public ref class PlanCircuit : public APIObject
type PlanCircuit =
    class
        inherit APIObject
    end
The PlanCircuit type exposes the following members.
Properties
Name | Description
Area | The enclosed area of the circuit.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
IsRoomLocated | Reports whether there is a room located in this circuit.
SideNum | The number of sides in the circuit.
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPointInside | Returns a point inside the circuit.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
Plan circuits are enclosed regions as seen on a plan view. They are used to determine the boundary extents of rooms based on the placement of walls. In the Autodesk Revit API, you can use plan circuits to create new rooms.
See Also
Reference
Autodesk.Revit.DB Namespace